{
    "scenarios": {
        "command": [""],
        "success" : ["asdasd", "xd", "lol"],
        "failure" : ["rasdasdip", "f", "asd"]
    },
    "responses":{
        "command": [""],
        "success": ["You have successfully landed on the planet"],
        "failure": ["You have failed to land on the planet"]
    },
    "tests": { 
        "test1": {
            "command": ["Run the Atmospheric composition Analysis. use the designated wavelengths.",
                        "Proceed with the Atmospheric compostion Analysis, focus on the gas signatures in the expected ranges.",
                        "Proceed with the atmospheric scan using the spectrometer to identify gas signatures."],
            "success": ["Alright... The analysis is complete! Readings are all in.", 
                        "Now that's what I'm talking about! We’re locked in. This is it. Prepare yourself, 'cause we’re about to crack open this planet's atmosphere like a piñata. Just sit tight, here comes the good stuff.", 
                        "Bingo! Now you’re speaking my language. We’ve hit the sweet spot. Get ready, 'cause this planet’s about to spill its secrets. The good stuff’s coming up!", 
                        "Alright, Spectrometer’s reading looks clean. No worries here!",
                        "We're all set! Everything checks out just fine.",
                        "Looks like the readings came through just fine. Everything’s as expected.",
                        "Now we’re talking! You nailed it, mi hermano. We’re right where we need to be. Hold tight, 'cause we’re about to hit paydirt!"],
            "close": ["Not bad, not bad at all. We’re getting closer, I can feel it. But not quite there yet. Keep your eyes peeled, amigo. We’re almost sniffing the right trail.",
                    "Closer, but not quite there. You’re almost on the money, but it’s still a little off. We’re in the right neighborhood, but not on the right street.",
                    "You’re on the right track, but still a bit off. I can feel we’re near the target, but not quite hitting the bullseye. Close, but no cigar.",
                    "Not too bad, but you’re still off by a bit. You’re poking around the edges, but we’re not quite in the zone yet. Almost there, just a little more.",
                    "Mmm, you’re close, real close. I can almost taste it, but we’re not quite there yet. Just a little more tweaking, and we’ll be right on the money.",
                    "Well, well, well… You’re in the neighborhood, but still a few blocks away. You’re not lost, but we need to dig a little deeper, amigo."],
            "failure": ["*Sighs* That did not work. Didn’t get any useful data.",
                        "Still too far, buddy. We’re not even in the ballpark. This one’s gonna leave us with nothing but a blank slate.",
                        "Hmm, something’s not right. We didn’t get the results we were hoping for.",
                        "That’s strange… I didn’t get any useful data. Might need another look.",
                        "Hmm, you took a swing, but you missed, my friend. Too far off the mark. Don’t expect much from this one; we’re not exactly knocking on the right door here.",
                        "I got some readings, but they seem a little off. Maybe we should try another pass?",
                        "Ah, that’s a swing and a miss. You went too far, way too far. We’re not even close, my friend. This one’s a bust, don’t expect any favors."]
        },
        "test2":{
            "command-standard": ["Activate the standard probe for a baseline temperature measurement.",
                                "Use the standard probe to measure the surface temperature."],
            "command-high": ["Deploy the high-temperature probe for surface temperature measurement.",
                            "Use the high-temperature probe for surface temperature measurement."],
            "command-deep": ["Send the deep probe to collect temperature data",
                            "Lower the deep probe into the surface layers to measure the temperatures."],
            "success-standard": ["Ah, now that’s a smart choice! You’ve got a knack for this, my friend. Let’s deploy this little guy and see what kind of temperature readings we can scoop up. I’m feeling good about this one!",
                                "Looks like everything’s perfect on this end. The standard probe got us the readings.",
                                "Nice! We’ve got solid data from the standard probe.",
                                "Hmmm... Great choice! You’ve got the right tool for the job. Let’s see what kind of temperature we’re dealing with here. I have a good feeling about this!"],
            "success-high": ["Now we’re cooking! The high-temperature probe is doing its thing. Let’s grab that data! I can already feel the warmth of some juicy numbers coming in!",
                            "High-temperature probe readings came in clean. Everything checks out.",
                            "Now we’re talking! You’ve got the right gear for the job. Let’s drop this probe and get to the bottom of things. Here’s hoping for some hot data to feast on!",
                            "High-temp probe’s on fire —well, not literally— but it did a great job!"],
            "success-deep": ["Deep probe got the job done! All data’s looking great.",
                            "Well, that went deep, and we’ve got the results. Nice job!",
                            "Deep probe’s in action, and I’m ready for some real action! Let’s dig deep and uncover those subsurface temperatures. I can almost taste the data!",
                            "Beautiful! The deep probe went all the way and got us exactly what we needed."],
            "failure-standard": ["Hmm, something’s not right. The standard probe didn’t return useful data.",
                                "Bad news... The standard probe melted. Looks like it couldn't handle the temperature.",
                                "Oh no, amigo, this isn’t gonna end well. The standard probe is already overheating! Looks like we’re out of luck; it’s broken by the heat. We need to rethink our approach here!",
                                "The standard probe seems to be malfunctioning. We’re getting nothing useful."],
            "failure-high": ["Come on, high-temp probe! We need some results, and you’re not delivering.",
                            "Whoa, hold on there! This bad boy isn’t built for a gentle touch. The probe can’t even get a read; the temperature isn’t reaching the minimum value. Looks like we’re in the wrong neighborhood!",
                            "Using a sledgehammer to crack a nut huh! No readings at all.",
                            "Uh-oh, this isn’t good. The high-temperature probe is struggling to even get a read. No minimum value detected. Classic case of 'wrong tool for the job!'"],
            "failure-deep": ["No data from the deep probe. We’ll need to troubleshoot that.",
                            "Alright, the deep probe is in action. But hold on... I’m not seeing any surface here. Just endless gas! Looks like we’re swimming in nothing but air. Time to rethink our strategy.",
                            "Alright, the deep probe is in the field. Just sitting here... waiting... Wait a second. There’s no surface to penetrate! This planet’s like a big fluffy cloud—no solid ground at all!",
                            "Alright, deployed the deep probe, but... wait a minute. I’m not getting anything here. No surface to penetrate. It’s like looking for a diamond in the sky—ain’t nothing there! Time to pivot!"]
        },
        "test3":{
            "command-radar": ["Run the radar imaging tool to scan the surface.",
                            "Initiate a full radar sweep to sacn the data."],
            "command-spectral": ["Begin the spectral analysis to identify additional data.",
                                "Run a spectral analysis on the surface to gather compositional data."],
            "success-radar": ["The radar imaging worked perfectly! We’ve got clear scans of the surface.",
                            "Success! We uncovered some intriguing formations thanks to the radar scan.",
                            "Great news! The radar imaging provided detailed insights into the terrain."],
            "success-spectral": ["Spectral analysis came through! We’ve got valuable data here",
                                "We hit the jackpot! The spectral analysis provided exactly the information we needed.",
                                "We’ve got excellent results from the spectral analysis"],
            "failure-radar": ["Bummer! The radar imaging didn’t capture any relevant data. We’ll need to reassess.",
                            "It seems the radar scan didn’t pick up anything useful. Let's check the settings.",
                            "Unfortunately, the radar imaging didn’t work as planned. Time to troubleshoot."],
            "failure-spectral": ["Unfortunately, the spectral analysis produced unreliable results.",
                                "We encountered issues with the spectral analysis. No useful data came through.",
                                "Hmm, the spectral analysis didn’t yield any clear results. We’ll need to refine our approach."]
        },
        "test4":{
            "command-1hr": ["Run a 1-hour transit scan on the planet.",
                            "Proceed with the 1-hour scan."],
            "command-3hr": ["Run a 3-hour transit scan on the planet.",
                            "Proceed with the 3-hour scan."],
            "command-6hr": ["Run a 6-hour transit scan on the planet.",
                            "Proceed with the 6-hour scan."],
            "success-1hr": ["We have successfully determined the mass, though further data is required to complete the analysis.",
                            "The mass has been identified, but without the remaining data, further conclusions are limited.",
                            "The mass is confirmed. We’ll need additional observations to determine the orbital period and distance."],
            "success-2hr": ["We’ve identified both the mass and its distance from the star. The orbital period remains undetermined.",
                            "Mass and distance from the star have been confirmed. Additional work is needed to ascertain the orbital period.",
                            "We’ve gathered reliable data on both mass and distance. Further analysis is necessary to complete the orbital profile."],
            "success-3hr": ["Mass, check. Distance, check. Orbital period, check. Analysis complete!",
                            "Complete data has been secured: mass, orbital period, and distance. The results are conclusive.",
                            "We got it all! Mass, orbital period, and distance from the star. Looks like we’re done here!"],
            "failure": ["It’s a total blank. We didn’t get any data. Something went wrong.",
                        "None of the data points are there. We’ll have to investigate the instruments.",
                        "The attempt to gather data was unsuccessful. A reassessment is required."]
        }
    }
}